src/Assets/AmadeusRequestTemplates/Ping.xml

<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Header>
		<AuthenticationSoapHeader xmlns="http://epowerv5.amadeus.com.tr/WS">
			<WSUserName>{{WSUserName}}</WSUserName>
      <WSPassword>{{WSPassword}}</WSPassword>
		</AuthenticationSoapHeader>
	</soap:Header>
	<soap:Body>
		<Ping xmlns="http://epowerv5.amadeus.com.tr/WS">
			<OTA_PingRQ>
				<EchoData>Hello</EchoData>
			</OTA_PingRQ>
		</Ping>
	</soap:Body>
</soap:Envelope>